Revit 2026 API

# PolyloopComputeArea Method

---

Gets the area for this polygon.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ComputeArea()
```
```vb
Public Function ComputeArea As Double
```
```cpp
public:
double ComputeArea()
```
```fsharp
member ComputeArea : unit -> float
```

#### Return Value

Double The area for this polygon.

The area of the planar non-self-intersecting polygon computed as: A = 1/2 * (X1 Y2) - (X2 Y1) + ... + (Xn Y1) - (X1 Yn)

#### Reference

Polyloop Class

Autodesk.Revit.DB.Analysis Namespace